---
kind: method
id: M:Autodesk.Revit.DB.Structure.AnalyticalModelSelector.Dispose
source: html/b245b120-6b36-9c7a-bcdf-179c982cc6d7.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalModelSelector.Dispose Method

Releases all resources used by the AnalyticalModelSelector

## Syntax (C#)
```csharp
public void Dispose()
```